In [79]:
import numpy as np

In [80]:
import pandas as pd

In [81]:
data = pd.Series([1,2,3,4,5])

In [82]:
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [83]:
data.values

array([1, 2, 3, 4, 5])

In [84]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [85]:
data[0]

1

In [86]:
data[1:3]

1    2
2    3
dtype: int64

In [87]:
data[4]

5

In [88]:
data = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])

In [89]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [90]:
data['c']

3

In [91]:
data = pd.Series(dict(a=1, b=2, c=3, d=4, e=5))

In [92]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [93]:
data['b':'d']

b    2
c    3
d    4
dtype: int64

In [94]:
series_1 = pd.Series(dict(a=1,b=2,c=3,d=4,e=5))

In [95]:
series_2 = pd.Series(dict(a=11,b=12,c=13,d=14,e=15))

In [96]:
df = pd.DataFrame({'column_1':series_1, 'column_2':series_2})

In [97]:
df

   column_1  column_2
a         1        11
b         2        12
c         3        13
d         4        14
e         5        15

In [98]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [99]:
df.columns

Index(['column_1', 'column_2'], dtype='object')

In [100]:
df['column_1']

a    1
b    2
c    3
d    4
e    5
Name: column_1, dtype: int64

In [ ]:
# df['a']

In [101]:
df['column_1']['a']

1

In [102]:
df['column_2']['c']

13

In [103]:
df2 = pd.DataFrame([[1,2,3],[11,12,13]], index=['a','b'], columns=['col_1','col_2','col_3'])

In [104]:
df2

   col_1  col_2  col_3
a      1      2      3
b     11     12     13

In [105]:
df.at['a', 'column_1']

1

In [106]:
df.at['b', 'column_2'] = 100

In [107]:
df

   column_1  column_2
a         1        11
b         2       100
c         3        13
d         4        14
e         5        15

In [108]:
df.iat[2,0]

3

In [110]:
df.iat[3,1] = 1000

In [111]:
df

   column_1  column_2
a         1        11
b         2       100
c         3        13
d         4      1000
e         5        15

In [112]:
df.loc['b':'d', 'column_1']

b    2
c    3
d    4
Name: column_1, dtype: int64

In [114]:
df.loc['d':'e', 'column_1':'column_2'] = [[0.1,0.2],[0.3,0.4]]

In [115]:
df

   column_1  column_2
a       1.0      11.0
b       2.0     100.0
c       3.0      13.0
d       0.1       0.2
e       0.3       0.4

In [116]:
df.iloc[[1,3], [0, 1]]

   column_1  column_2
b       2.0     100.0
d       0.1       0.2

In [117]:
df.iloc[[2,4],[0,1]] = [[1001,1002],[1003,1004]]

In [118]:
df

   column_1  column_2
a       1.0      11.0
b       2.0     100.0
c    1001.0    1002.0
d       0.1       0.2
e    1003.0    1004.0

In [119]:
df.loc['a':'b', 'column_1':'column_2'] = [[3.1, 2.2], [1.4, 6.8]] #pandas loc演習

In [120]:
df

   column_1  column_2
a       3.1       2.2
b       1.4       6.8
c    1001.0    1002.0
d       0.1       0.2
e    1003.0    1004.0

In [121]:
df.to_csv('df_data.csv')

In [122]:
df2.to_excel('df2_data.xlsx')

In [123]:
df3 = pd.read_csv('df_data.csv')

In [124]:
df4 = pd.read_excel('df2_data.xlsx')

In [125]:
df3

  Unnamed: 0  column_1  column_2
0          a       3.1       2.2
1          b       1.4       6.8
2          c    1001.0    1002.0
3          d       0.1       0.2
4          e    1003.0    1004.0

In [126]:
df4

  Unnamed: 0  col_1  col_2  col_3
0          a      1      2      3
1          b     11     12     13

In [127]:
df3 = pd.read_csv('df_data.csv') #pandas csv 演習